package tests;

import io.qameta.allure.AllureId;
import io.qameta.allure.Story;
import org.junit.jupiter.api.DisplayName;
import org.junit.jupiter.api.Test;

import static io.qameta.allure.Allure.step;

@Story("ManuelTests")
public class ManuelTests {
    @Test
    @AllureId("123456")
    @DisplayName("Википедия карта поиск Москвы")
    public void carttesting() {
        step("Открываем приложние");
        step("Открываем главную страницу");
        step("Выбираем Москва на карте", () -> {
            step("Нажимаем на кнопку Места");
            step("Отображается карта");
            step("Отображается строка поиска");
            step("В строку поиска вводится Москва");
            step("Нажимается кнопка Найти");
            step("Отображается строка поиска");
        });
        step("Проверяем, что Москва надена на карте", () -> {
            step("В строке поиска отображается - Москва");
            step("Отображается карта Москвы");
            step("Отображается текст Москва Столица и крупнейшй город");
        });
    }
    @Test
    @AllureId("123457")
    @DisplayName("Добавление английского в Языки Википедии")
    public void enCustomization() {
        step("Открываем приложние");
        step("Открываем главную страницу");
        step("Нажимаем на иконку учетная запись (правый верхний угол)", () -> {
            step("Отображается страница Учетная запись");
            step("Нажимается кнопка настройки");
            step("Отображается страница Настройки");
            step("В строку поиска вводится Москва");
            step("Нажимается кнопка Мои языки");
            step("Отображается страница  Языки Википедии");
            step("Нажимается кнопка Добавить еще один язык");
            step("Отображается плейсхолдер Языковой фильтр");
            step("В Языковой фильтр вводится текст Английский");
            step("В результатах поиска есть English");
            step("Нажимается текст English");
            step("В окне Ваши языки появился English");
            step("В результатах поиска есть English");
        });
        step("Проверяем, что английский добавлен в Языки Википедии", () -> {
            step("На странице Языки Википедии в разделе Ваши языки появился English");
        });
    }
}
